# Queries: Sakila (Core)

Craig Gossen

In [1]:
#Imports
import pandas as pd
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()

In [2]:
username = 'root'
password = 'root'
db_name = 'sakila'
connection = f'mysql+pymysql://{username}:{password}@localhost/{db_name}' #format is  dialect+driver://username:password@host:port/database
engine = create_engine(connection) 
engine #to verify engine

Engine(mysql+pymysql://root:***@localhost/sakila)

1. What query would you run to get all the customers inside city_id = 312? Your query should return the customers' first name, last name, email, address, and city.

In [3]:
q = """SELECT 
    cu.customer_id, ct.city_id
FROM
    customer AS cu,
    city AS ct
WHERE
    city_id = 312;"""

pd.read_sql(q, engine)

     customer_id  city_id
0              1      312
1              2      312
2              3      312
3              5      312
4              7      312
..           ...      ...
594          582      312
595          584      312
596          590      312
597          593      312
598          599      312

[599 rows x 2 columns]

2. What query would you run to get all comedy films? Note that the genre is called the category in this schema. Your query should return film title, description, release year, rating, and special features.

In [4]:
q = """SELECT 
    title, description, release_year, rating, special_features
FROM
    film;"""

pd.read_sql(q, engine)

,title,description,release_year,rating,special_features
0,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,PG,"Deleted Scenes,Behind the Scenes"
1,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,G,"Trailers,Deleted Scenes"
2,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,NC-17,"Trailers,Deleted Scenes"
3,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,G,"Commentaries,Behind the Scenes"
4,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,G,Deleted Scenes
...,...,...,...,...,...
995,YOUNG LANGUAGE,A Unbelieveable Yarn of a Boat And a Database ...,2006,G,"Trailers,Behind the Scenes"
996,YOUTH KICK,A Touching Drama of a Teacher And a Cat who mu...,2006,NC-17,"Trailers,Behind the Scenes"
997,ZHIVAGO CORE,A Fateful Yarn of a Composer And a Man who mus...,2006,NC-17,Deleted Scenes
998,ZOOLANDER FICTION,A Fateful Reflection of a Waitress And a Boat ...,2006,R,"Trailers,Deleted Scenes"
999,ZORRO ARK,A Intrepid Panorama of a Mad Scientist And a B...,2006,NC-17,"Trailers,Commentaries,Behind the Scenes"

3. What query would you run to get all the films that Johnny Lollobrigida was in? Your query should return the actor's last name, film title, and release year.

In [11]:
q = """SELECT 
    actor.last_name, film.title, film.release_year
FROM
    actor, film
WHERE
    actor.last_name =  "Lollobrigida"
    
    ;"""

pd.read_sql(q, engine)

        last_name              title  release_year
0    LOLLOBRIGIDA   ACADEMY DINOSAUR          2006
1    LOLLOBRIGIDA     ACE GOLDFINGER          2006
2    LOLLOBRIGIDA   ADAPTATION HOLES          2006
3    LOLLOBRIGIDA   AFFAIR PREJUDICE          2006
4    LOLLOBRIGIDA        AFRICAN EGG          2006
..            ...                ...           ...
995  LOLLOBRIGIDA     YOUNG LANGUAGE          2006
996  LOLLOBRIGIDA         YOUTH KICK          2006
997  LOLLOBRIGIDA       ZHIVAGO CORE          2006
998  LOLLOBRIGIDA  ZOOLANDER FICTION          2006
999  LOLLOBRIGIDA          ZORRO ARK          2006

[1000 rows x 3 columns]

4. What query would you run to get the first and last names of all the actors in the movie titled "Bingo Talented"?

In [14]:
q = """SELECT 
    actor.first_name, actor.last_name, film_actor.film_id
FROM 
    actor, film_actor
WHERE
    film_actor.film_id = "Bingo Talented"
    
    ;"""

pd.read_sql(q, engine)

Empty DataFrame
Columns: [first_name, last_name, film_id]
Index: []

5. What query would you run to get the customer_id associated with all payments greater than twice the average payment amount? (HINT: use 2* in your query to get twice the amount). Your result should include the customer id and the amount.

In [10]:
q = """SELECT 
     customer_id, 2*AVG(amount)
FROM
    payment
WHERE 
    amount > (SELECT 2*AVG(amount) FROM payment)
GROUP BY 
    customer_id 
ORDER BY
    2*AVG(amount) DESC
    ;"""

pd.read_sql(q, engine)

     customer_id  2*AVG(amount)
0            116          23.98
1            195          23.98
2            204          23.98
3              2          21.98
4             12          21.98
..           ...            ...
454          586          17.98
455          587          17.98
456          593          17.98
457          594          17.98
458          597          17.98

[459 rows x 2 columns]

6. What query would you run to list the first and last names of the 5 customers who have the highest number(count) of payments? You can title the number of payments as num_payments.

In [8]:
q = """SELECT DISTINCT
    p.amount, c.first_name, c.last_name
FROM
    payment AS p, customer AS c
ORDER BY
    p.amount DESC
LIMIT
    5
    
    
    ;"""

pd.read_sql(q, engine)

   amount first_name last_name
0   11.99   PATRICIA   JOHNSON
1   11.99    BARBARA     JONES
2   11.99      LINDA  WILLIAMS
3   11.99  ELIZABETH     BROWN
4   11.99       MARY     SMITH